# Shells & Prompt
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Version Managers
brew "fnm"
brew "pyenv"

# Node
brew "node"
brew "pnpm"

# Git
brew "git"
brew "git-delta"
brew "gh"

# CLI Tools
brew "bat"
brew "eza"
brew "fzf"
brew "ripgrep"
brew "zoxide"

# Swift / Xcode
brew "xcbeautify"

# Apps
cask "chatgpt"
cask "codex"
cask "db-browser-for-sqlite"
cask "github"
cask "visual-studio-code"

# VS Code Extensions
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "openai.chatgpt"
vscode "swiftlang.swift-vscode"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
