# Shells & Prompt
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Git
brew "git-delta"
brew "gh"

# CLI Tools
brew "bat"
brew "eza"
brew "fzf"
brew "ripgrep"
brew "zoxide"

# Swift / Xcode
brew "xcbeautify"

# VS Code Extensions
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "swiftlang.swift-vscode"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
